0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           $internalField;
        // type            turbulentIntensityKineticEnergyInlet;
        // intensity       0.05;
        // value           $internalField;
    }
    OUTLET
    {
        type            zeroGradient;
        //type            inletOutlet;
        //inletValue      uniform 0.375;
        //value           $internalField;
    }
    WALL_DOWN
    {
        type            symmetry;        
//        type            inletOutlet;
//        inletValue      uniform 0.375;
//        value           $internalField;
    }
    WALL_UP
    {
        type            symmetry;        
//        type            inletOutlet;
//        inletValue      uniform 0.375;
//        value           $internalField;
    }
    WALL_CYLINDER
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
