0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2567;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 2567;
    }

    OUTLET
    {
        type            zeroGradient;
        //type            inletOutlet;
        //inletValue      uniform 2567;
        //value           uniform 2567;
    }

    WALL_DOWN
    {
        type            symmetry;
//        type            inletOutlet;
//        inletValue      uniform 2567;
//        value           uniform 2567;
    }
    WALL_UP
    {
        type            symmetry;
//        type            inletOutlet;
//        inletValue      uniform 2567;
//        value           uniform 2567;
    }

    WALL_CYLINDER
    {
        type            omegaWallFunction;
        value           uniform 2567;
    }

    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
